In [1]:
import pandas as pd

In [10]:
df=pd.read_csv('stock_data.csv', skiprows=1) #df=pd.read_csv('stock_data.csv',header=1)

In [11]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [14]:
df1=pd.read_csv('stock_data1.csv')

In [15]:
df1

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [16]:
df1=pd.read_csv("stock_data1.csv",header=None, names=["tickerss","epss","revenues","prices","peoplee"])

In [17]:
df1

  tickerss           epss revenues prices        peoplee
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [21]:
df1=pd.read_csv("stock_data1.csv", na_values=["not available","n.a."])

In [22]:
df1

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

Also, here revenue is -1. There is no company that has a revenue of -1. So, it kinda resonates with NaN. We need to convert that as well.

In [27]:
df1=pd.read_csv("stock_data1.csv", 
                na_values={ 
                "eps":["not available","n.a."],
                "revenue":["not available","n.a.",-1],
                "people":["not available","n.a."]})

In [28]:
df1

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [31]:
df1.to_csv('new_stock_data.csv', index=False)

Skipping some columns and saving the data into a new csv

In [35]:
df1.to_csv('skipped_data.csv', columns=['tickers','eps'], index=False)

 If we don't want the header to be in the file then we can just add header=False
 like this:
 df.to_csv("new_data_no_header.csv",header=False)

Reading excel files

In [36]:
import pandas as pd

In [37]:
df=pd.read_excel("stock_data.xlsx","Sheet1")

In [38]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Here the people's data in row no. 3 is n.a. We can change it since we know the owner of Walmart.

In [44]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'anis blanco'
    return cell
def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell

In [45]:
df=pd.read_excel('stock_data.xlsx','Sheet1', converters={'people':convert_people_cell,'eps':convert_eps_cell})

In [46]:
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65    anis blanco
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

This is not a good way to use converters. As if there are more than n.a. then it is not a good method to follow.

Now, writing to an excel file

In [53]:
df.to_excel("new.xlsx", sheet_name='blanco_stocks', index=False)

In [54]:
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65    anis blanco
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [55]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [56]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")